import React from "react";
import { useTranslation } from "react-i18next";

function PolicyAndPrivacy() {
  const themeColor = localStorage.getItem("themeColor");
  const [t, i18n] = useTranslation();

  return (
    <div className="max-w-4xl m-auto pt-5 p-3">
      <h3 className={`font-xxl fw-bolder text-current mb-4`}>
        {t("Politics and privacy")}{" "}
      </h3>
      <div className="mb-5">
        <p>
          هناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل
          وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروء
        </p>
      </div>
      <div className="mb-5">
        <p>
          هناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل
          وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروء
        </p>
      </div>
      <div className="mb-5">
        <p>
          هناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل
          وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى
          المقروءهناك حقسه منذ زمن طويل وهى ان المحتوى المقروءهناك حقسه منذ زمن
          طويل وهى ان المحتوى المقروء
        </p>
      </div>
    </div>
  );
}

export default PolicyAndPrivacy;
